sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.c
/*!
    \file    gd32a7xx_fmu.c
    \brief   FMU driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/
/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_fmu.h"

#define FMU_CFG_INIT_MASK                  ((uint32_t)(0x03FF0FF8U))
#define FMU_CTL_OPR_STAT_MASK              ((uint32_t)(0x000000C0U))
#define FMU_FFIO_CONTROL_STAT_MASK         ((uint32_t)(0x00000030U))
#define FMU_GFP_CONTROL_STAT_MASK          ((uint32_t)(0x00000040U))

#define FMU_WORK_STAT_MASK                 ((uint32_t)(0x00000007U))
#define FMU_FAULTY_STAT_MASK               ((uint32_t)(0x00000008U))
#define FMU_FAKE_FG_MASK                   ((uint32_t)(0x000000FFU))

#define FMU_COMM_LEFT_SHIFT_VAL            ((uint32_t)(0x00000001U))
#define FMU_SOFT_TRIG_FAULT_SNUM           ((uint32_t)(0x00000088U))

/*!
    \brief      initialize the struct parameters of FMU FIO (API_ID(0x0001U))
    \param[in]  none
    \param[out] fmu_fio_struct: init parameter struct, refer to fmu_fio_parameter_struct
    \retval     none
*/
void fmu_fio_para_init(fmu_fio_parameter_struct* fmu_fio_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(fmu_fio_struct)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0001U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the struct parameters of FMU FIO to the default values */
        fmu_fio_struct->gosen               = FMU_GOS_DISABLE;
        fmu_fio_struct->fosen               = FMU_FOS_DISABLE;
        fmu_fio_struct->foscfg              = FMU_FFIO_CONTRONL_FSM;
        fmu_fio_struct->goscfg              = FMU_GFIO_CONTRONL_FSM;
        fmu_fio_struct->fopre               = FMU_FOPRE_DIV_2;
        fmu_fio_struct->fomcfg              = FMU_FOMCFG_NOTCONSISTENT;
        fmu_fio_struct->gopcfg              = FMU_GOPS_LOW;
        fmu_fio_struct->fopcfg              = FMU_FOPCFG_HIGH1_LOW0;
        fmu_fio_struct->fomset              = FMU_FOMSET_MODE_BI_STABLE;
        fmu_fio_struct->gomset              = FMU_GOMSET_FAULT_OUTPUT_MODE;
    }
}

/*!
    \brief      configure FMU FIO (API_ID(0x0002U))
    \param[in]  fmu_fio_struct: init parameter struct, refer to fmu_parameter_struct, the member values are shown as below:
      \arg        gosen: enable or disable GFIO signal, the value can be FMU_GOS_ENABLE or FMU_GOS_DISABLE
      \arg        fosen: enable or disable FFIO signals, the value can be FMU_FOS_ENABLE or FMU_FOS_DISABLE
      \arg        foscfg: configure FFIO signals, the value can be FMU_FFIO_CONTRONL_FSM, FMU_FFIO_CONTRONL_LOW or FMU_FFIO_CONTRONL_HIGH
      \arg        goscfg: configure GFIO signal, the value can be FMU_GFIO_CONTRONL_FSM, FMU_GFIO_CONTRONL_LOW or FMU_GFIO_CONTRONL_HIGH
      \arg        fopre: configure fatal fault output pin signals time switching clock prescaler, the value can be
                          FMU_FOPRE_DIV_x(x=2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096)
      \arg        fomcfg: configure FFIO signals work mode is consistent with FG fault or not when FMU is in INIT work mode, the value can be
                          FMU_FOMCFG_SAME or FMU_FOMCFG_NOTCONSISTENT
      \arg        gopcfg: configure GFIO signal polarity, the value can be FMU_GOPS_HIGH or FMU_GOPS_LOW
      \arg        fopcfg: configure FFIO signal polarity, the value can be FMU_FOPCFG_HIGH0_LOW1 or FMU_FOPCFG_HIGH1_LOW0
      \arg        fomset: set FFIO signals work mode, the value can be FMU_FOMSET_MODE_BI_STABLE, FMU_FOMSET_MODE_TIME_SWITCHING or FMU_FOMSET_MODE_TESTx(x=0, 1, 2)
      \arg        gomset: set GFIO signal work mode, the value can be FMU_GOMSET_FAULT_OUTPUT_MODE, FMU_GOMSET_MODE_TEST0 or FMU_GOMSET_MODE_TEST1
    \param[out] none
    \retval     none
*/
void fmu_fio_config(fmu_fio_parameter_struct* fmu_fio_struct)
{
    uint32_t reg = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(fmu_fio_struct)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg &= FMU_CFG_INIT_MASK;

        reg |= fmu_fio_struct->gosen;
        reg |= fmu_fio_struct->fosen;
        reg |= fmu_fio_struct->foscfg;
        reg |= fmu_fio_struct->goscfg;
        reg |= fmu_fio_struct->fopre;
        reg |= fmu_fio_struct->fomcfg;
        reg |= fmu_fio_struct->gopcfg;
        reg |= fmu_fio_struct->fopcfg;
        reg |= fmu_fio_struct->fomset;
        reg |= fmu_fio_struct->gomset;

        FMU_CFG = (uint32_t)(reg);
    }
}

/*!
    \brief      initialize the parameters of FMU structure with the default values (API_ID(0x0003U))
    \param[in]  none
    \param[out] fmu_struct: the initialized structure fmu_parameter_struct pointer
    \retval     none
*/
void fmu_para_init(fmu_parameter_struct* fmu_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(fmu_struct)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        fmu_struct->recovery_type                = FMU_SW_RECOVERY;
        fmu_struct->sub_rst                      = DISABLE;
        fmu_struct->fault_group_en               = DISABLE;
        fmu_struct->caution_timeout_en           = DISABLE;
        fmu_struct->caution_timeout_value        = FMU_CAUTION_TIMEOUT_INIT_VALUE;
        fmu_struct->init_timeout_value           = FMU_INIT_TIMEOUT_INIT_VALUE;
        fmu_struct->faultout_timer_value         = FMU_FAULTOUT_TIME_INIT_VALUE;
        fmu_struct->caution_int_en               = DISABLE;
        fmu_struct->nmi_en                       = DISABLE;
        fmu_struct->ffio_output_en               = DISABLE;
        fmu_struct->gfio_output_en               = DISABLE;
        fmu_struct->gpo_en                       = DISABLE;
    }
}

/*!
    \brief      configure FMU parameter (API_ID(0x0004U))
    \param[in]  fmu_struct: initialization stuct, refer to fmu_parameter_struct, the member values are shown as below:
      \arg        recovery_type: fault recovery type, the value can be FMU_HW_RECOVERY or FMU_SW_RECOVERY
      \arg        sub_rst: configure fault group subsystem reset, the value can be ENABLE or DISABLE
      \arg        fault_group_en: configure fault group, the value can be ENABLE or DISABLE
      \arg        caution_timeout_en: configure fault group CAUTION  work mode timeout, the value can be ENABLE or DISABLE
      \arg        caution_timeout_value:fault group CAUTION  work mode timeout value, the value can be 0 ~ 0XFFFFFFFFU
      \arg        init_timeout_value: INIT work mode timeout value, the value can be 0 ~ 0X7U
      \arg        faultout_timer_value: fault output (FFIO) timer value, the value can be 0 ~ 0X1FFFU
      \arg        caution_int_en: configure CAUTION work mode interrupt request, the value can be ENABLE or DISABLE
      \arg        nmi_en: configure NMI request, the value can be ENABLE or DISABLE
      \arg        ffp_output_en: configure FFIO signals, the value can be ENABLE or DISABLE
      \arg        gfp_output_en: configure GFIO signal, the value can be ENABLE or DISABLE
      \arg        gpo_en: configure FAULT work mode holding timer output (GPO), the value can be ENABLE or DISABLE
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x (x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_config(fmu_parameter_struct* fmu_struct, uint16_t fault_group_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(fmu_struct)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0004U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure FMU fault group recovery type */
        fmu_fg_recovery_type_config(fmu_struct->recovery_type, fault_group_id);
        
        /* configure FMU fault group subsystem reset reaction */
        fmu_fault_reaction_config(FMU_FRETN_SUBRST2RCU, fault_group_id, fmu_struct->sub_rst);

        /* configure FMU fault group subsystem reset reaction */
        fmu_fault_reaction_config(FMU_FRETN_CAUINT2CPU, fault_group_id, fmu_struct->caution_int_en);

