sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.c
        /* configure FMU fault group NMI reaction */
        fmu_fault_reaction_config(FMU_FRETN_NMI2CPU, fault_group_id, fmu_struct->nmi_en);

        /* configure FMU fault group FFIO output reaction */
        fmu_fault_reaction_config(FMU_FRETN_FFIO, fault_group_id, fmu_struct->ffio_output_en);

        /* configure FMU fault group GFIO output reaction */
        fmu_fault_reaction_config(FMU_FRETN_GFIO, fault_group_id, fmu_struct->gfio_output_en);

        /* configure FMU fault group GFIO output reaction */
        fmu_fault_reaction_config(FMU_FRETN_GPO, fault_group_id, fmu_struct->gpo_en);

        /* configure FMU timers value */
        fmu_timer_config(FMU_INIT_TIMEROUT, fmu_struct->init_timeout_value);
        fmu_timer_config(FMU_CAUTION_TIMEROUT, fmu_struct->caution_timeout_value);
        fmu_timer_config(FMU_FAULT_OUTPUT_TIMER, fmu_struct->faultout_timer_value);

        /* configure FMU FG CAUTION timerout enable or disable */
        if(ENABLE == fmu_struct->caution_timeout_en) {
            fmu_caution_timeout_enable(fault_group_id);
        } else {
            fmu_caution_timeout_disable(fault_group_id);
        }

        /* gpo_en FMU FG enable or disable */
        if(ENABLE == fmu_struct->fault_group_en) {
            fmu_fg_enable(fault_group_id);
        } else {
            fmu_fg_disable(fault_group_id);
        }
    }
}

/*!
    \brief      execute FMU operation (API_ID(0x0005U))
    \param[in]  operation_type: execute operation type, refer to fmu_operation_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_TRAN_INIT_WORK_MODE: FMU execute operation that transform to INIT work mode 
      \arg        FMU_TRAN_NORMAL_WORK_MODE: FMU execute operation that transform to CAUTION work mode
      \arg        FMU_CLR_HOLDING_STATUS_REGS: FMU execute operation that clear the hold status register
      \arg        FMU_CLR_OPERATION: FMU execute operation that clear operation status
      \arg        FMU_NO_EXE_OPERATION: FMU no execute operation
    \param[out] none
    \retval     none
*/
void fmu_operation_execute(fmu_operation_enum operation_type)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_OPTYPE(operation_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_CTL;
        reg &= ~FMU_CTL_EOP;

        switch(operation_type){
        /* FMU unlock operation1 and excute operation will which transform FMU to INIT work mode */
        case FMU_TRAN_INIT_WORK_MODE:
            reg |= FMU_TO_INIT_WORK_MODE;
            FMU_CTLKEY = FMU_EOP1_KEY_U32;
            FMU_CTL = reg;
            break;
        /* FMU unlock operation2 and excute operation will which transform FMU to NORMAL work mode */
        case FMU_TRAN_NORMAL_WORK_MODE:
            reg |= FMU_TO_NORMAL_WORK_MODE;
            FMU_CTLKEY = FMU_EOP2_KEY_U32;
            FMU_CTL = reg;
            break;
        /* FMU excute operation which will clear the hold status registers */
        case FMU_CLR_HOLDING_STATUS_REGS:
            reg |= FMU_CLR_HOLD_STATUS_REGS;
            FMU_CTL = reg;
            break;
        /* FMU excute operation which will set opeartion status is idle */
        case FMU_CLR_OPERATION:
            reg |= FMU_CLR_OPERATION_STATUS;
            FMU_CTL = reg;
            break;
        /* FMU default no excute operation */
        case FMU_NO_EXE_OPERATION:
            reg |= FMU_NO_OPERATION;
            FMU_CTL = reg;
            break;
        default :
            break;
        }
    }
}

/*!
    \brief      FMU read current operation status (API_ID(0x0006U))
    \param[in]  none
    \param[out] none
    \retval     fmu_operation_status_enum: FMU_OPS_IDLE, FMU_OPS_ONGOING, FMU_OPS_NOTSUCCESS, FMU_OPS_SUCCESS
*/
fmu_operation_status_enum fmu_operation_status_read(void)
{
    uint32_t reg;
    fmu_operation_status_enum result = FMU_OPS_IDLE;
    reg = FMU_CTL;
    reg &= FMU_CTL_OPR_STAT_MASK;

    switch(reg){
    /* FMU current operation status is idle */
    case FMU_OPSTAT_IDLE:
        result = FMU_OPS_IDLE;
        break;
    /* FMU current operation status is on going */
    case FMU_OPSTAT_ONGOING:
        result = FMU_OPS_ONGOING;
        break;
    /* FMU current operation status is not success */
    case FMU_OPSTAT_NOTSUCCESS:
        result = FMU_OPS_NOTSUCCESS;
        break;
    /* FMU current operation status is success */
    case FMU_OPSTAT_SUCCESS:
        result = FMU_OPS_SUCCESS;
        break;
    /* FMU default operation status is idle */
    default:
        break;
    }

    return result;
}

/*!
    \brief      unlock FMU (API_ID(0x0007U))
    \param[in]  lock_type: FMU lock type, refer to fmu_lock_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_LOCK_EOP1: EOP1 lock
      \arg        FMU_LOCK_EOP2: EOP2 lock 
      \arg        FMU_LOCK_FG_STAT: FG status lock
      \arg        FMU_LOCK_TRANS_TEMP: INIT work mode transition temporary lock
    \param[out] none
    \retval     none
*/
void fmu_unlock(fmu_lock_type_enum lock_type)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_LKTYPE(lock_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (lock_type) {
        /* unlock EOP1 */
        case FMU_LOCK_EOP1:
            FMU_CTLKEY = (uint32_t)FMU_EOP1_KEY_U32;
            break;

        /* unlock EOP2 */
        case FMU_LOCK_EOP2:
            FMU_CTLKEY = (uint32_t)FMU_EOP2_KEY_U32;
            break;

        /* unlock FG status */
        case FMU_LOCK_FG_STAT:
            FMU_FGKEY = (uint32_t)FMU_FG_KEY_UNLOCK_U32;
            break;

        /* unlock INIT work mode transition temporary */
        case FMU_LOCK_TRANS_TEMP:
            FMU_TCLOCK = (uint32_t)FMU_TEMP_UNLOCK_KEY_U32; 
            break;

        default:
            break;
        }
    }
}

/*!
    \brief      lock FMU (API_ID(0x0008U))
    \param[in]  lock_type: FMU lock type, refer to fmu_lock_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_LOCK_TRANS_TEMP: INIT work mode transition temporary lock
      \arg        FMU_LOCK_TRANS_PERM: INIT work mode transition permanent lock
    \param[out] none
    \retval     none
*/
void fmu_lock(fmu_lock_type_enum lock_type)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_LKTYPE_LK(lock_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (lock_type) {
        /* lock INIT work mode transition temporary */
        case FMU_LOCK_TRANS_TEMP:
            FMU_TCLOCK = FMU_TEMP_LOCK_KEY_U32;
            break;

        /* lock INIT work mode transition permanent */
        case FMU_LOCK_TRANS_PERM:
            FMU_PCLOCK = FMU_PERM_LOCK_KEY_U32;
            break;

        default:
            break;
        }
    }
}

/*!
    \brief      configure FMU recovery type (API_ID(0x0009U))
    \param[in]  recovery_type: FMU fault recovery type
                only one parameter can be selected which is shown as below:
      \arg        FMU_HW_RECOVERY: hardware recoverable
      \arg        FMU_SW_RECOVERY: software recoverable
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x (x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_fg_recovery_type_config(uint16_t recovery_type, uint16_t fault_group_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_RECOVERY_TYPE(recovery_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    }  else if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (FMU_SW_RECOVERY == recovery_type) {
            FMU_FGCFG |= (uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id);
        } else {
            FMU_FGCFG &= ~((uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id));
        }
    }
}

/*!
    \brief      configure FMU fault reaction (API_ID(0x000AU))
    \param[in]  reaction_type: FMU fault reaction type, refer to fmu_fretn_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_FRETN_CAUINT2CPU: CAUTION work mode interrupt request
      \arg        FMU_FRETN_SUBRST2RCU: FG subsystem reset reaction 
      \arg        FMU_FRETN_NMI2CPU: FG FAULT work mode NMI interrupt request
      \arg        FMU_FRETN_FFIO: FG FFIO pin output
      \arg        FMU_FRETN_GFIO: FG GFIO pin output
      \arg        FMU_FRETN_GPO: FAULT work status holding timer output
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x(x=0 ~ 11)
    \param[in]  new_value: ENABLE or DISABLE
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: enable reaction
      \arg        DISABLE: disable reaction
    \param[out] none
    \retval     none
*/
void fmu_fault_reaction_config(fmu_fretn_type_enum reaction_type, uint16_t fault_group_id, ControlStatus new_value)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_REACTION_TYPE(reaction_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else if(NOT_FMU_CONTROL_STATUS(new_value)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (reaction_type) {
        /* configure subsystem reset */
        case FMU_FRETN_CAUINT2CPU:
            if (ENABLE == new_value) {
                FMU_CMINTREN |= (uint32_t)(FMU_CMI_ENABLE << fault_group_id);
            } else {
                FMU_CMINTREN &= ~((uint32_t)(FMU_CMI_ENABLE << fault_group_id));
            }
            break;

        /* configure subsystem reset */
        case FMU_FRETN_SUBRST2RCU:
            if (ENABLE == new_value) {
                FMU_FGSUBSRCFG |= (uint32_t)(FMU_SUB_RST_ENABLE << ((uint32_t)fault_group_id*2U));
            } else {
                FMU_FGSUBSRCFG &= ~((uint32_t)(FMU_SUB_RST_DISABLE << ((uint32_t)fault_group_id*2U)));
            }
            break;

