sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.c
        /* configure NMI to cpu */
        case FMU_FRETN_NMI2CPU:
            if (ENABLE == new_value) {
                FMU_FMNMIINTREN |= (uint32_t)(FMU_NMI_ENABLE << fault_group_id);
            } else {
                FMU_FMNMIINTREN &= ~((uint32_t)(FMU_NMI_ENABLE << fault_group_id));
            }
            break;

        /* configure FFIO */
        case FMU_FRETN_FFIO:
            if (ENABLE == new_value) {
                FMU_FPOEN |= (uint32_t)(FMU_PINOUT_ENABLE << fault_group_id);
            } else {
                FMU_FPOEN &= ~((uint32_t)(FMU_PINOUT_ENABLE << fault_group_id));
            }
            break;
        
        /* configure GFIO */
        case FMU_FRETN_GFIO:
            if (ENABLE == new_value) {
                FMU_GPOEN |= (uint32_t)(FMU_PINOUT_ENABLE << fault_group_id);
            } else {
                FMU_GPOEN &= ~((uint32_t)(FMU_PINOUT_ENABLE << fault_group_id));
            }
            break;
        
        /* configure GPO */
        case FMU_FRETN_GPO:
            if (ENABLE == new_value) {
                FMU_FHTOEN |= (uint32_t)(FMU_HOLD_TIMER_ENABLE << fault_group_id);
            } else {
                FMU_FHTOEN &= ~((uint32_t)(FMU_HOLD_TIMER_ENABLE << fault_group_id));
            }
            break;
        
        default:
            break;
        }
    }
}

/*!
    \brief      configure FMU timer (API_ID(0x000BU))
    \param[in]  tim_type: FMU timer type, refer to fmu_tim_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_CAUTION_TIMEROUT: FG CAUTION work mode timerout value
      \arg        FMU_INIT_TIMEROUT: FG INIT work mode timerout value
      \arg        FMU_FAULT_OUTPUT_TIMER: FG FAULT work mode timer
    \param[in]  tim_value: the vaule write to timer
    \param[out] none
    \retval     none
*/
void fmu_timer_config(fmu_tim_type_enum tim_type, uint32_t tim_value)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_TIMTYPE(tim_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (tim_type){
        case FMU_CAUTION_TIMEROUT:
            FMU_FGCMTVAL = tim_value;
            break;
        case FMU_INIT_TIMEROUT:
#ifdef FW_DEBUG_ERR_REPORT
            /* check parameter */
            if(NOT_FMU_TIMER_IMT_LENGTH(tim_value)) {
                fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_OUT_OF_RANGE);
            } else
#endif /* FW_DEBUG_ERR_REPORT */
            {
                FMU_IMTVAL = tim_value;
            }
            break;
        case FMU_FAULT_OUTPUT_TIMER:
#ifdef FW_DEBUG_ERR_REPORT
            /* check parameter */
            if(NOT_FMU_TIMER_FOT_LENGTH(tim_value)) {
                fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_OUT_OF_RANGE);
            } else
#endif /* FW_DEBUG_ERR_REPORT */
            {
                FMU_FOT = tim_value;
            }
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure FMU FIO (API_ID(0x000CU))
    \param[in]  fault_pin: FMU fault pin
                only one parameter can be selected which is shown as below:
      \arg        FMU_FFPO_0: FFIO output pin 0
      \arg        FMU_FFPO_1: FFIO output pin 1
      \arg        FMU_GFPO: GFIO output pin
    \param[in]  output_value: SET or RESET
                only one parameter can be selected which is shown as below:
      \arg        RESET: the output value is low level
      \arg        SET: the output value is high level
    \param[out] none
    \retval     none
*/
void fmu_fio_output_config(uint32_t fault_pin, fio_status output_value)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FO(fault_pin)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_FIO_STATUS(output_value)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(RESET != output_value) {
            FMU_FPCTL |= (uint32_t)fault_pin;
        } else {
            FMU_FPCTL &= (uint32_t)(~fault_pin);
        }
    }
}

/*!
    \brief      get FMU fault IO signal input status (API_ID(0x000DU))
    \param[in]  fault_pin: FMU fault pin
                only one parameter can be selected which is shown as below:
      \arg        FMU_FFPI_0: FFIO input pin 0
      \arg        FMU_FFPI_1: FFIO input pin 1
      \arg        FMU_GFPI: GFIO input pin
    \param[out] none
    \retval     fio_status: FMU fault pin input status (SET or RESET)
*/
fio_status fmu_fio_input_get(uint32_t fault_pin)
{
    uint32_t reg;
    fio_status reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FI(fault_pin)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_FPCTL;

        switch(fault_pin){
        /* FMU FFpin0 and FFpin input status are low */
        case FMU_FFPI_0:
            reg &= FMU_FFPI_0;
            break;
        /* FMU FFpin0 input status is low and FFpin input status is high */
        case FMU_FFPI_1:
            reg &= FMU_FFPI_1;
            break;
        /* FMU FFpin0 input status is high and FFpin input status is low */
        case FMU_GFPI:
            reg &= FMU_GFPI;
            break;
        /* FMU FFpin0 and FFpin default input statuss are low */
        default:
            break;
        }

        /*get fault pin input status */
        if(0U != reg) {
            reval =  SET;
        } else {
            reval =  RESET;
        }
    }

    return reval;
}

/*!
    \brief      read FMU FFIO signal control status (API_ID(0x000EU))
    \param[in]  none 
    \param[out] none
    \retval     fmu_ffio_status_enum: FMU control status
*/
fmu_ffio_status_enum fmu_ffio_status_read(void)
{
    uint32_t reg;
    fmu_ffio_status_enum reval = FFIO_STATUS_LOW0_LOW1;
    reg = FMU_STAT;
    reg &= FMU_FFIO_CONTROL_STAT_MASK;

