sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.c
    switch(reg) {
    /* FMU FFpin0 and FFpin input status are low */
    case FMU_FFIO_LOW0_LOW1:
        reval = FFIO_STATUS_LOW0_LOW1;
        break;
    /* FMU FFpin0 input status is low and FFpin input status is high */
    case FMU_FFIO_LOW0_HIGH1:
        reval = FFIO_STATUS_LOW0_HIGH1;
        break;
    /* FMU FFpin0 input status is high and FFpin input status is low */
    case FMU_FFIO_HIGH0_LOW1:
        reval = FFIO_STATUS_HIGH0_LOW1;
        break;
    /* FMU FFpin0 and FFpin input statuss are high */
    case FMU_FFIO_HIGH0_HIGH1:
        reval = FFIO_STATUS_HIGH0_HIGH1;
        break;
    /* FMU FFpin0 and FFpin default input statuss are low */
    default:
        break;
    }

    return reval;
}

/*!
    \brief      read FMU GFpin signal control status (API_ID(0x000FU))
    \param[in]  none 
    \param[out] none
    \retval     fio_status: SET or RESET
*/
fio_status fmu_gfio_status_read(void)
{
    uint32_t reg;
    fio_status reval = RESET;
    reg = FMU_STAT;
    reg &= FMU_GFP_CONTROL_STAT_MASK;

    if(0U != reg) {
        /* FMU GFpin current input status is high */
        reval = SET;
    } else {
    }

    return reval;
}

/*!
    \brief      get FMU status (API_ID(0x0010U))
    \param[in]  none 
    \param[out] none
    \retval     fmu_faulty_status_enum: FMU_NO_FAULTY or FMU_IN_FAULTY
*/
fmu_faulty_status_enum fmu_status_get(void)
{
    uint32_t reg;
    fmu_faulty_status_enum reval = FMU_NO_FAULTY;

    reg = FMU_STAT;
    reg &= FMU_FAULTY_STAT_MASK;

    if(0U != reg) {
        /* FMU status is faulty */
        reval = FMU_IN_FAULTY;
    } else {
        /* FMU status is no faulty */
    }

    return reval;
}

/*!
    \brief      read FMU current work mode (API_ID(0x0011U))
    \param[in]  none 
    \param[out] none
    \retval     fmu_status_enum: FMU_STATUS_NORMAL, FMU_STATUS_INIT, FMU_STATUS_CAUTION, FMU_STATUS_FAULT
*/
fmu_status_enum fmu_workmode_read(void)
{
    uint32_t reg;
    fmu_status_enum reval = FMU_STATUS_NORMAL;
    reg = FMU_STAT;
    reg &= FMU_WORK_STAT_MASK;
    
    switch(reg){
    /* FMU current status is NORMAL status */
    case FMU_NORMAL_STATUS:
        reval = FMU_STATUS_NORMAL;
        break;
    /* FMU current status is INIT status */
    case FMU_INIT_STATUS:
        reval = FMU_STATUS_INIT;
        break;
    /* FMU current status is CAUTION status */
    case FMU_CAUTION_STATUS:
        reval = FMU_STATUS_CAUTION;
        break;
    /* FMU current status is FAULT status */
    case FMU_FAULT_STATUS:
        reval = FMU_STATUS_FAULT;
        break;
    /* FMU default status is NORMAL status */
    default:
        break;
    }

    return reval;
}

/*!
    \brief      injection FMU fake FG fault (API_ID(0x0012U))
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x(x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_ff_injection(uint32_t fault_group_id)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_FFGNCFG;
        reg &= ~FMU_FAKE_FG_MASK;
        reg |= (uint32_t)fault_group_id;
        FMU_FFGNCFG = reg;
    }
}

/*!
    \brief      read FMU transition FG (API_ID(0x0013U))
    \param[in]  trans_type: FMU work mode transition type, refer to fmu_trans_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_TRANS_N2C: FMU work mode transition type is NORMAL to CAUTION
      \arg        FMU_TRANS_C2F: FMU work mode transition type is CAUTION to FAULT
      \arg        FMU_TRANS_N2F: FMU work mode transition type is NORMAL to FAULT
      \arg        FMU_TRANS_F2C: FMU work mode transition type is FAULT to CAUTION
    \param[out] none
    \retval     uint32_t: FMU transition FG (0 ~ 0X7FF)
*/
uint32_t fmu_trans_fg_read(fmu_trans_type_enum trans_type)
{
    uint32_t trans_fg = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_TRANS_TYPE(trans_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (trans_type) {
        /* lock INIT work mode transition temporary */
        case FMU_TRANS_N2C:
            trans_fg = ((uint32_t)FMU_NTCHSTAT);
            break;

        /* lock INIT work mode transition permanent */
        case FMU_TRANS_C2F:
            trans_fg = ((uint32_t)FMU_CTFHSTAT);
            break;
        
        /* lock INIT work mode transition temporary */
        case FMU_TRANS_N2F:
            trans_fg = ((uint32_t)FMU_NTFHSTAT);
            break;

        /* lock INIT work mode transition permanent */
        case FMU_TRANS_F2C:
            trans_fg = ((uint32_t)FMU_FTCHSTAT);
            break;

        default:
            break;
        }
    }

    return trans_fg;
}

/*!
    \brief      read FMU counter (API_ID(0x0014U))
    \param[in]  cnt_type: FMU counter type, refer to fmu_cnt_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_CAUTION_WORK_MODE_CNT: FG CAUTION work mode counter
      \arg        FMU_INIT_WORK_MODE_CNT: FG INIT work mode counter
      \arg        FMU_FF_OUTPUT_CNT: fatal fault output counter
      \arg        FMU_GF_OUTPUT_CNT: general fault output counter
    \param[out] none
    \retval     uint32_t: value of counter (0 ~ 0XFFFFFFFF)
*/
uint32_t fmu_counter_read(fmu_cnt_type_enum cnt_type)
{
    uint32_t cnt = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_CNT_TYPE(cnt_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (cnt_type){
        case FMU_CAUTION_WORK_MODE_CNT:
            cnt = (uint32_t)FMU_CMCNT;
            break;
        case FMU_INIT_WORK_MODE_CNT:
            cnt = (uint32_t)FMU_IMCNT;
            break;
        case FMU_FF_OUTPUT_CNT:
            cnt = (uint32_t)FMU_FOCNT;
            break;
        case FMU_GF_OUTPUT_CNT:
            cnt = (uint32_t)FMU_GOCNT;
            break;
        default:
            break;
        }
    }

    return cnt;
}

/*!
    \brief      configure FMU TMR error output (API_ID(0x0015U))
    \param[in]  tmr_error_type: FMU TMR error type, refer to fmu_tmr_error_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_TME0_DBGEN: enable TMR error output 0
      \arg        FMU_TME1_FOS_GOS_ENCFG: enable TMR error output 1
      \arg        FMU_TME2_FG_ENCFG: enable TMR error output 2
    \param[in]  new_value: ENABLE or DISABLE
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: enable TMR error output
      \arg        DISABLE: disable TMR error output
    \param[out] none
    \retval     none
*/
void fmu_tmr_error_output_config(fmu_tmr_error_type_enum tmr_error_type, ControlStatus new_value)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_TMR_ERR_TYPE(tmr_error_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else if(NOT_FMU_CONTROL_STATUS(new_value)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (tmr_error_type) {
        /* configure TMR error output 0 */
        case FMU_TME0_DBGEN:
            if (ENABLE == new_value) {
                FMU_TMRES |= FMU_TMRES_TMREN0;
            } else {
                FMU_TMRES &= ~(FMU_TMRES_TMREN0);
            }
            break;

        /* configure TMR error output 1 */
        case FMU_TME1_FOS_GOS_ENCFG:
            if (ENABLE == new_value) {
                FMU_TMRES |= FMU_TMRES_TMREN1;
            } else {
                FMU_TMRES &= ~(FMU_TMRES_TMREN1);
            }
            break;

        /* configure TMR error output 2 */
        case FMU_TME2_FG_ENCFG:
            if (ENABLE == new_value) {
                FMU_TMRES |= FMU_TMRES_TMREN2;
            } else {
                FMU_TMRES &= ~(FMU_TMRES_TMREN2);
            }
            break;

        default:
            break;
        }
    }
}

/*!
    \brief      get FMU fault flag (API_ID(0x0016U))
    \param[out] none
    \retval     uint32_t: FMU fault flag, 0 ~ 0X7FF
*/
uint32_t fmu_fault_flag_get(void)
{
    uint32_t reg;
    reg = FMU_FGSTAT;

    return reg;
}

/*!
    \brief      clear FMU FG status (if SW recoverable) (API_ID(0x0017U))
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x(x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_fg_status_clear(uint16_t fault_group_id)
{
    uint32_t reg;

