sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_FGSTAT;

        FMU_FGKEY = (uint32_t)FMU_FG_KEY_UNLOCK_U32;
        reg |= (uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id);
        FMU_FGSTAT = reg;
    }
}

/*!
    \brief      get FMU group fault status (API_ID(0x0018U))
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x(x=0 ~ 11)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmu_fg_status_get(uint16_t fault_group_id)
{
    uint32_t reg;
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = (uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id);
        reg &= FMU_FGSTAT;

        if(0U != reg) {
            /* FMU group status is faulty */
            reval =  SET;
        } else {
            /* FMU group status is no faulty */
            reval =  RESET;
        }
    }

    return reval;
}

/*!
    \brief      get FMU FG trigger source status (API_ID(0x0019U))
    \param[in]  trigger_source_num: FMU FG trigger source number(0 ~ 0X9F)
    \param[out] none
    \retval     FlagStatus: trigger source status (SET or RESET)
*/
FlagStatus fmu_fg_trigger_source_status_get(uint8_t trigger_source_num)
{
    FlagStatus reval = RESET;
    uint32_t reg, temp_val;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FAKE_FG_VALUE(trigger_source_num)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0019U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_FGTSSTAT((uint32_t)trigger_source_num / 32U);
        temp_val = BIT(trigger_source_num % 32U);
        if(0U != (reg & temp_val)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }

    return reval;
}

/*!
    \brief      clear FMU FG trigger source status (API_ID(0x001AU))
    \param[in]  trigger_source_num: FMU FG trigger source number(0 ~ 0X9F)
    \param[out] none
    \retval     none
*/
void fmu_fg_trigger_source_status_clear(uint8_t trigger_source_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FAKE_FG_VALUE(trigger_source_num)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x001AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FGTSSTAT((uint32_t)trigger_source_num / 32U) |= BIT(trigger_source_num % 32U);
    }
}

/*!
    \brief      get FMU TMR error output status (API_ID(0x001BU))
    \param[in]  tmr_error_type: FMU TMR error type, refer to fmu_tmr_error_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_TME0_DBGEN: enable TMR error output 0
      \arg        FMU_TME1_FOS_GOS_ENCFG: enable TMR error output 1
      \arg        FMU_TME2_FG_ENCFG: enable TMR error output 2
    \param[out] none
    \retval     FlagStatus: FMU TMR error output status (SET or RESET)
*/
FlagStatus fmu_tmr_error_status_get(fmu_tmr_error_type_enum tmr_error_type)
{
    uint32_t reg;
    FlagStatus reval = RESET;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_TMR_ERR_TYPE(tmr_error_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_TMRES;

        switch(tmr_error_type){
        /* get TMR error output status 0 */
        case FMU_TME0_DBGEN:
            reg &= FMU_TMRES_TMRS0;
            break;
        /* get TMR error output status 1 */
        case FMU_TME1_FOS_GOS_ENCFG:
            reg &= FMU_TMRES_TMRS1;
            break;
        /* get TMR error output status 2 */
        case FMU_TME2_FG_ENCFG:
            reg &= FMU_TMRES_TMRS2;
            break;

        default:
            break;
        }

        /* get fault pin input status */
        if(0U != reg) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }

    return reval;
}

/*!
    \brief      clear FMU TMR error output status (API_ID(0x001CU))
    \param[in]  tmr_error_type: FMU TMR error type, refer to fmu_tmr_error_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_TME0_DBGEN: enable TMR error output 0
      \arg        FMU_TME1_FOS_GOS_ENCFG: enable TMR error output 1
      \arg        FMU_TME2_FG_ENCFG: enable TMR error output 2
    \param[out] none
    \retval     none
*/
void fmu_tmr_error_status_clear(fmu_tmr_error_type_enum tmr_error_type)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_TMR_ERR_TYPE(tmr_error_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_TMRES;

        switch(tmr_error_type){
        /* clear TMR error output status 0 */
        case FMU_TME0_DBGEN:
            reg |= FMU_TMRES_TMRS0;
            break;
        /* clear TMR error output status 1 */
        case FMU_TME1_FOS_GOS_ENCFG:
            reg |= FMU_TMRES_TMRS1;
            break;
        /* clear TMR error output status 2 */
        case FMU_TME2_FG_ENCFG:
            reg |= FMU_TMRES_TMRS2;
            break;

        default:
            break;
        }

        FMU_TMRES = reg;
    }
}

/*!
    \brief      enable FMU debug mode (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmu_dbg_enable(void)
{
    FMU_CTL |= (uint32_t)FMU_CTL_DBGEN;
}

/*!
    \brief      disable FMU debug mode (API_ID(0x001EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmu_dbg_disable(void)
{
    FMU_CTL &= (uint32_t)(~FMU_CTL_DBGEN);
}

/*!
    \brief      enabled FMU FG (API_ID(0x001FU))
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x(x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_fg_enable(uint16_t fault_group_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x001FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FGEN |= (uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id);
    }
}

/*!
    \brief      disabled FMU FG (API_ID(0x0020U))
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x(x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_fg_disable(uint16_t fault_group_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FGEN &= ~(uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id);
    }
}

/*!
    \brief      enable FMU CAUTION timeout (API_ID(0x0021U))
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x(x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_caution_timeout_enable(uint16_t fault_group_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FGCMTEN |= (uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id);
    }
}

/*!
    \brief      disable FMU CAUTION timeout (API_ID(0x0022U))
    \param[in]  fault_group_id: fault group id
                only one parameter can be selected which is shown as below:
      \arg        FAULT_GROUP_ID_x: FAULT_GROUP_ID_x (x=0 ~ 11)
    \param[out] none
    \retval     none
*/
void fmu_caution_timeout_disable(uint16_t fault_group_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FG(fault_group_id)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FGCMTEN &= ~(uint32_t)(FMU_COMM_LEFT_SHIFT_VAL << fault_group_id);
    }
}

/*!
    \brief      enable injection FMU fake FG (API_ID(0x0023U))
    \param[in]  none 
    \param[out] none
    \retval     none
*/
void fmu_ff_inject_enable(void)
{
    uint32_t reg;

    reg = FMU_FFGNCFG;
    reg &= ~FMU_FFGNCFG_FFGEN;
    reg |= (uint32_t)FMU_FAKE_FG_ENABLE;

    FMU_FFGNCFG = reg;
}

/*!
    \brief      disable injection FMU fake FG (API_ID(0x0024U))
    \param[in]  none 
    \param[out] none
    \retval     none
*/
void fmu_ff_inject_disable(void)
{
    uint32_t reg;
    
    reg = FMU_FFGNCFG;
    reg &= ~FMU_FFGNCFG_FFGEN;
    reg |= (uint32_t)FMU_FAKE_FG_DISABLE;

    FMU_FFGNCFG = reg;
}

/*!
    \brief      enable FMU FG trigger source (API_ID(0x0025U))
    \param[in]  trigger_source_num: FMU FG trigger source number(0 ~ 0X9F)
    \param[out] none
    \retval     none
*/
void fmu_fg_trigger_source_enable(uint8_t trigger_source_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FAKE_FG_VALUE(trigger_source_num)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0025U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FGTSEN((uint32_t)trigger_source_num / 32U) |= BIT(trigger_source_num % 32U);
    }
}

/*!
    \brief      disable FMU FG trigger source (API_ID(0x0026U))
    \param[in]  trigger_source_num: FMU FG trigger source number(0 ~ 0X9F)
    \param[out] none
    \retval     none
*/
void fmu_fg_trigger_source_disable(uint8_t trigger_source_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_FAKE_FG_VALUE(trigger_source_num)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0026U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FGTSEN((uint32_t)trigger_source_num / 32U) &= ~(BIT(trigger_source_num % 32U));
    }
}

/*!
    \brief      enable FMU software triggered fault (API_ID(0x0027U))
    \param[in]  soft_trig_fault_num: FMU software triggered fault number(0X88 ~ 0X9F)
    \param[out] none
    \retval     none
*/
void fmu_fg_soft_trig_fault_enable(uint8_t soft_trig_fault_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_SOFT_TRI_VALUE(soft_trig_fault_num)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0027U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FG_SWTEN((soft_trig_fault_num-FMU_SOFT_TRIG_FAULT_SNUM)/8U) |= BIT(((soft_trig_fault_num-FMU_SOFT_TRIG_FAULT_SNUM) % 8U)*2U);
    }
}

/*!
    \brief      disable FMU software triggered fault (API_ID(0x0028U))
    \param[in]  soft_trig_fault_num: FMU software triggered fault number(0X88 ~ 0X9F)
    \param[out] none
    \retval     none
*/
void fmu_fg_soft_trig_fault_disable(uint8_t soft_trig_fault_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_SOFT_TRI_VALUE(soft_trig_fault_num)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x0028U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        FMU_FG_SWTEN((soft_trig_fault_num-FMU_SOFT_TRIG_FAULT_SNUM)/8U) &= ~(1U << (((soft_trig_fault_num-FMU_SOFT_TRIG_FAULT_SNUM) % 8U)*2U));
    }
}

/*!
    \brief      enable FMU INIT status timeout interrupt (API_ID(0x0029U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmu_init_timeout_irq_enable(void)
{
    FMU_IMTINTREN |= (uint32_t)FMU_IMTINTREN_INITTIE;
}

/*!
    \brief      disable FMU INIT status timeout interrupt (API_ID(0x002AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmu_init_timeout_irq_disable(void)
{
    FMU_IMTINTREN &= (uint32_t)(~FMU_IMTINTREN_INITTIE);
}

/*!
    \brief      get FMU current interrupt status (API_ID(0x002BU))
    \param[in]  int_type: interrupt type, refer to fmu_int_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_INT_INIT: INIT timeout interrupt is pending
      \arg        FMU_INT_CAUTION: CAUTION timeout interrupt is pending
      \arg        FMU_INT_NMI: NMI interrupt 
    \param[out] none
    \retval     FlagStatus: interrupt flag status (SET or RESET)
*/
FlagStatus fmu_interrupt_flag_get(fmu_int_type_enum int_type)
{
    uint32_t reg;
    FlagStatus reval = RESET;

