sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmu.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_INT_TYPE(int_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x002BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = FMU_INTRPD;

        switch(int_type){
        /* FMU INIT timeout interrupt is pending */
        case FMU_INT_INIT:
            reg &= FMU_INTRPD_INITINTRPD;
            break;
        /* FMU CAUTION timeout interrupt is pending */
        case FMU_INT_CAUTION:
            reg &= FMU_INTRPD_CAUINTRPD;
            break;
        /* FMU NMI is pending */
        case FMU_INT_NMI:
            reg &= FMU_INTRPD_NMIINTRPD;
            break;
        /* FMU default no interrupt is pending */
        default:
            break;
        }

        /* get flag status */
        if(0U != reg) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }

    return reval;
}

/*!
    \brief      clear FMU interrupt flag (API_ID(0x002CU))
    \param[in]  int_type: interrupt type, refer to fmu_int_type_enum
                only one parameter can be selected which is shown as below:
      \arg        FMU_INT_INIT: INIT timeout interrupt is pending
    \param[out] none
    \retval     none
*/
void fmu_interrupt_flag_clear(fmu_int_type_enum int_type)
{

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMU_INT_TYPE_CLEAR(int_type)) {
        fw_debug_report_err(FMU_MODULE_ID, API_ID(0x002CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch (int_type){
        case FMU_INT_INIT:
            FMU_INTRPD |= FMU_INIT_INT_PEND;
            break;
        default:
            break;
        }
    }
}
